---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ExternalUIService
source: html/7aec9b28-3d5a-abcd-f487-afffa5504239.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ExternalUIService Property

Unique service id.

## Syntax (C#)
```csharp
public static ExternalServiceId ExternalUIService { get; }
```